upstream/OpenFOAM-v2606/tutorials/multiphase/compressibleInterFoam/laminar/climbingRod/Allrun
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------

runApplication blockMesh

runApplication extrudeMesh

restore0Dir

runApplication setFields

runApplication $(getApplication)

#------------------------------------------------------------------------------
